const { solution, getElement } = require('../12949-행렬의 곱셈');

describe("행렬의 곱셈", () => {
    test("원소 구하기", () => {
        expect(getElement([[2, 3, 2], [4, 2, 4], [3, 1, 4]], [[5, 4, 3], [2, 4, 1], [3, 1, 1]], 0, 0)).toBe(22);
    });

    test("배열 구하기1", () => {
        expect(solution([[1, 4], [3, 2], [4, 1]], [[3, 3], [3, 3]])).toEqual([[15, 15], [15, 15], [15, 15]]);
    });

    test("배열 구하기2", () => {
        expect(solution([[2, 3, 2], [4, 2, 4], [3, 1, 4]], [[5, 4, 3], [2, 4, 1], [3, 1, 1]])).toEqual([[22, 22, 11], [36, 28, 18], [29, 20, 14]]);
    });
});
